#+TITLE: Exercise 3.2

In software-testing applications, it is useful to be able to count the number of times a given procedure is called during the course of a computation. Write a procedure make-monitored that takes as input a procedure, f, that itself takes one input. The result returned by make-monitored is a third procedure, say mf, that keeps track of the number of times it has been called by maintaining an internal counter. If the input to mf is the special symbol how-many-calls?, then mf returns the value of the counter. If the input is the special symbol reset-count, then mf resets the counter to zero. For any other input, mf returns the result of calling f on that input and increments the counter. For instance, we could make a monitored version of the sqrt procedure:

#+BEGIN_SRC scheme :results silent
  (define s (make-monitored sqrt))

  (s 100)
  10

  (s 'how-many-calls?)
  1
#+END_SRC

* Solution

#+BEGIN_SRC scheme :session acc :results silent
  (define (make-monitored f)
    (define count 0)

    (define (dispatch query)
      (cond ((eq? query 'how-many-calls?) count)
            ((eq? query 'reset-count)
             (set! count 0))
            (else
             (set! count (+ 1 count))
             (f query))))

    dispatch)

  (define (square x)
    (* x x))

  (define s (make-monitored square))
#+END_SRC

* Tests

** Call s 3 times

#+BEGIN_SRC scheme :session acc :exports both
  (s 10)
#+END_SRC

#+RESULTS:
: 100

#+BEGIN_SRC scheme :session acc :exports both
  (s 5)
#+END_SRC

#+RESULTS:
: 25

#+BEGIN_SRC scheme :session acc :exports both
  (s 3)
#+END_SRC

#+RESULTS:
: 9

#+BEGIN_SRC scheme :session acc :exports both
  (s 'how-many-calls?)
#+END_SRC

#+RESULTS:
: 3

** Reset the count

#+BEGIN_SRC scheme :session acc :exports both
  (s 'reset-count)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC scheme :session acc :exports both
  (s 'how-many-calls?)
#+END_SRC

#+RESULTS:
: 0

** Call once

#+BEGIN_SRC scheme :session acc :exports both
  (s 2)
#+END_SRC

#+RESULTS:
: 4

#+BEGIN_SRC scheme :session acc :exports both
  (s 'how-many-calls?)
#+END_SRC

#+RESULTS:
: 1

